; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-34)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room4)
(at ball23 room4)
(at ball24 room4)
(at ball25 room4)
(at ball26 room4)
(at ball27 room4)
(at ball28 room4)
(at ball29 room4)
(at ball30 room4)
(at ball31 room4)
(at ball32 room4)
(at ball33 room4)
(at ball34 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 room3)
(at ball2 room3)
(at ball3 room3)
(at ball4 room3)
(at ball5 room3)
(at ball6 room3)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at ball28 room3)
(at ball29 room3)
(at ball30 room3)
(at ball31 room3)
(at ball32 room3)
(at ball33 room3)
(at ball34 room3)
)
)
)

; plan
1. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 10 of 34
2. (pick ball6 rooma right)
   deleted: (at ball6 rooma) (free right)
   added: (carry ball6 right)
   goals met: 10 of 34
3. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 10 of 34
4. (drop ball6 room3 right)
   deleted: (carry ball6 right)
   added: (at ball6 room3) (free right)
   goals met: 11 of 34
5. (drop ball7 room3 left)
   deleted: (carry ball7 left)
   added: (at ball7 room3) (free left)
   goals met: 12 of 34
6. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 12 of 34
7. (pick ball9 roomb left)
   deleted: (at ball9 roomb) (free left)
   added: (carry ball9 left)
   goals met: 12 of 34
8. (pick ball8 roomb right)
   deleted: (at ball8 roomb) (free right)
   added: (carry ball8 right)
   goals met: 12 of 34
9. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 12 of 34
10. (drop ball8 room3 right)
   deleted: (carry ball8 right)
   added: (at ball8 room3) (free right)
   goals met: 13 of 34
11. (drop ball9 room3 left)
   deleted: (carry ball9 left)
   added: (at ball9 room3) (free left)
   goals met: 14 of 34
12. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 14 of 34
13. (pick ball11 roomb left)
   deleted: (at ball11 roomb) (free left)
   added: (carry ball11 left)
   goals met: 14 of 34
14. (pick ball10 roomb right)
   deleted: (at ball10 roomb) (free right)
   added: (carry ball10 right)
   goals met: 14 of 34
15. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 14 of 34
16. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 14 of 34
17. (drop ball10 room3 right)
   deleted: (carry ball10 right)
   added: (at ball10 room3) (free right)
   goals met: 15 of 34
18. (drop ball11 room3 left)
   deleted: (carry ball11 left)
   added: (at ball11 room3) (free left)
   goals met: 16 of 34
19. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 16 of 34
20. (pick ball34 room4 left)
   deleted: (at ball34 room4) (free left)
   added: (carry ball34 left)
   goals met: 16 of 34
21. (pick ball33 room4 right)
   deleted: (at ball33 room4) (free right)
   added: (carry ball33 right)
   goals met: 16 of 34
22. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 16 of 34
23. (drop ball33 room3 right)
   deleted: (carry ball33 right)
   added: (at ball33 room3) (free right)
   goals met: 17 of 34
24. (drop ball34 room3 left)
   deleted: (carry ball34 left)
   added: (at ball34 room3) (free left)
   goals met: 18 of 34
25. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 18 of 34
26. (pick ball32 room4 left)
   deleted: (at ball32 room4) (free left)
   added: (carry ball32 left)
   goals met: 18 of 34
27. (pick ball31 room4 right)
   deleted: (at ball31 room4) (free right)
   added: (carry ball31 right)
   goals met: 18 of 34
28. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 18 of 34
29. (drop ball31 room3 right)
   deleted: (carry ball31 right)
   added: (at ball31 room3) (free right)
   goals met: 19 of 34
30. (drop ball32 room3 left)
   deleted: (carry ball32 left)
   added: (at ball32 room3) (free left)
   goals met: 20 of 34
31. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 20 of 34
32. (pick ball30 room4 left)
   deleted: (at ball30 room4) (free left)
   added: (carry ball30 left)
   goals met: 20 of 34
33. (pick ball29 room4 right)
   deleted: (at ball29 room4) (free right)
   added: (carry ball29 right)
   goals met: 20 of 34
34. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 20 of 34
35. (drop ball29 room3 right)
   deleted: (carry ball29 right)
   added: (at ball29 room3) (free right)
   goals met: 21 of 34
36. (drop ball30 room3 left)
   deleted: (carry ball30 left)
   added: (at ball30 room3) (free left)
   goals met: 22 of 34
37. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 22 of 34
38. (pick ball28 room4 left)
   deleted: (at ball28 room4) (free left)
   added: (carry ball28 left)
   goals met: 22 of 34
39. (pick ball27 room4 right)
   deleted: (at ball27 room4) (free right)
   added: (carry ball27 right)
   goals met: 22 of 34
40. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 22 of 34
41. (drop ball27 room3 right)
   deleted: (carry ball27 right)
   added: (at ball27 room3) (free right)
   goals met: 23 of 34
42. (drop ball28 room3 left)
   deleted: (carry ball28 left)
   added: (at ball28 room3) (free left)
   goals met: 24 of 34
43. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 24 of 34
44. (pick ball26 room4 left)
   deleted: (at ball26 room4) (free left)
   added: (carry ball26 left)
   goals met: 24 of 34
45. (pick ball25 room4 right)
   deleted: (at ball25 room4) (free right)
   added: (carry ball25 right)
   goals met: 24 of 34
46. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 24 of 34
47. (drop ball25 room3 right)
   deleted: (carry ball25 right)
   added: (at ball25 room3) (free right)
   goals met: 25 of 34
48. (drop ball26 room3 left)
   deleted: (carry ball26 left)
   added: (at ball26 room3) (free left)
   goals met: 26 of 34
49. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 26 of 34
50. (pick ball24 room4 left)
   deleted: (at ball24 room4) (free left)
   added: (carry ball24 left)
   goals met: 26 of 34
51. (pick ball23 room4 right)
   deleted: (at ball23 room4) (free right)
   added: (carry ball23 right)
   goals met: 26 of 34
52. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 26 of 34
53. (drop ball23 room3 right)
   deleted: (carry ball23 right)
   added: (at ball23 room3) (free right)
   goals met: 27 of 34
54. (drop ball24 room3 left)
   deleted: (carry ball24 left)
   added: (at ball24 room3) (free left)
   goals met: 28 of 34
55. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 28 of 34
56. (pick ball22 room4 left)
   deleted: (at ball22 room4) (free left)
   added: (carry ball22 left)
   goals met: 28 of 34
57. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 28 of 34
58. (drop ball22 room3 left)
   deleted: (carry ball22 left)
   added: (at ball22 room3) (free left)
   goals met: 29 of 34
59. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 29 of 34
60. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 29 of 34
61. (pick ball4 rooma right)
   deleted: (at ball4 rooma) (free right)
   added: (carry ball4 right)
   goals met: 29 of 34
62. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 29 of 34
63. (drop ball4 room3 right)
   deleted: (carry ball4 right)
   added: (at ball4 room3) (free right)
   goals met: 30 of 34
64. (drop ball5 room3 left)
   deleted: (carry ball5 left)
   added: (at ball5 room3) (free left)
   goals met: 31 of 34
65. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 31 of 34
66. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 31 of 34
67. (pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 31 of 34
68. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 31 of 34
69. (drop ball2 room3 right)
   deleted: (carry ball2 right)
   added: (at ball2 room3) (free right)
   goals met: 32 of 34
70. (drop ball3 room3 left)
   deleted: (carry ball3 left)
   added: (at ball3 room3) (free left)
   goals met: 33 of 34
71. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 33 of 34
72. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 33 of 34
73. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 33 of 34
74. (drop ball1 room3 left)
   deleted: (carry ball1 left)
   added: (at ball1 room3) (free left)
   goals met: 34 of 34
